## Data preprocessing

Here we are getting the data in the correct format using pandas

In [2]:
import pandas as pd

dataset=pd.read_csv('titanic.csv')
dataset.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

Now i restrained myself from going the Canara way.. So instead of substituting for the NULL values and then dropping the columns, we drop the columns first and then drop the unnecessary columns.

In [3]:
dataset.drop(['PassengerId','Name','SibSp','Parch','Ticket','Cabin','Embarked'],axis='columns',inplace=True)
dataset.head()

   Survived  Pclass     Sex   Age     Fare
0         0       3    male  22.0   7.2500
1         1       1  female  38.0  71.2833
2         1       3  female  26.0   7.9250
3         1       1  female  35.0  53.1000
4         0       3    male  35.0   8.0500

In [4]:
print(dataset.isnull().sum())

Survived      0
Pclass        0
Sex           0
Age         177
Fare          0
dtype: int64

In [5]:
dataset.fillna(dataset.mean(), inplace=True)
print(dataset.isnull().sum())

Survived    0
Pclass      0
Sex         0
Age         0
Fare        0
dtype: int64

In [6]:
inputs=dataset.drop('Survived',axis='columns')
target=dataset['Survived']
inputs.head()

   Pclass     Sex   Age     Fare
0       3    male  22.0   7.2500
1       1  female  38.0  71.2833
2       3  female  26.0   7.9250
3       1  female  35.0  53.1000
4       3    male  35.0   8.0500

In [7]:
from sklearn.preprocessing import LabelEncoder

le_sex=LabelEncoder()

inputs['sex']=le_sex.fit_transform(inputs['Sex'])

inputs=inputs.drop(['Sex'],axis='columns')
inputs.head()

   Pclass   Age     Fare  sex
0       3  22.0   7.2500    1
1       1  38.0  71.2833    0
2       3  26.0   7.9250    0
3       1  35.0  53.1000    0
4       3  35.0   8.0500    1

## Model Evaluation

After the Herculian task of data preprocessing  we now move on to apply the USP of this code.. The RandomForestClassifier....Yay ...Full detailed info in README..Pleez do check.

In [8]:
from sklearn.model_selection import train_test_split

x_train,x_test,y_train,y_test=train_test_split(inputs,target,test_size=0.2,random_state=0)

In [14]:
from sklearn.ensemble import RandomForestClassifier
from sklearn.metrics import accuracy_score
import time

model=RandomForestClassifier(n_estimators=10)
start=time.time()
model1.fit(x_train,y_train)
stop=time.time()

y_pred=model1.predict(x_test)
print("Time taken is : "+str((stop-start)*100)+" ms")
print("Random Forest Classifer accuracy is : "+str(accuracy_score(y_test,y_pred)*100)+" %")

Time taken is : 3.6974191665649414 ms
Random Forest Classifer accuracy is : 82.12290502793296 %